Практические задания к экзамену
=======

1.Какова функция отрицательного индекса в списке? Приведите пример
использования.

2.Что будет являться результатом вывода:

    75 == 75

    x = [2,4,8,16,32]
        print(x[::2])

    for x in [1, 2, 3]:
        print x

3.Примите два значения от пользователя и сделайте операцию умножения и
если результат больше 1000, верните его сумму.
Взяв диапазон чисел от 0 до 10, проитерируйте их с первого до последнего и
выведите сумму текущего числа с предыдущим.

4.Получите строку от пользователя и выведите только те символы, которые
имеют четный индекс в алфавите str.

5.Выведите паттерн такого вида на экран:
    
    1
    1 2
    1 2 3
    1 2 3 4
    1 2 3 4 5

6.Напишите функцию, которая принимает две переменные и возвращает сумму
и разницу в одном вызове. Выведите результат через одну переменную.

7.Пользуясь списками, удалите упоминания чисел 13 из него через функцию.
[10, 13, 16, 4, 7, 13, 2, 13]

8.Напишите программу через классы, возводящую числа в степень (не
используя оператор power).

9.Напишите вывод данной функции:

    for x in range(0.5, 5.5, 0.5):
    print(x)

10.Создайте класс, который содержит хотя бы 2 метода:
- получение строки от пользователя;
- вывод строки в верхнем регистре.

11.Напишите функцию, которая производит операцию конкатенации строк и
выводит результат.

12.Задача: Функция принимает две строки и должна вывести строку с большим
кол-вом символов.

13.Сделайте функцию, определяющую четность чисел.

14.Обозначьте функцию, которая создает список, где значения являются числами
от 1 до 20, возведенные в третью степень. Затем, она выводит первые 5 чисел
из списка.

15.Напишите функцию, производящую операцию деления на 0, а затем поймайте
исключение и сделайте вывод на экран `Деление на 0!`

16.Напишите программу, которая принимает строку от пользователя и
возвращает ее с символами в обратном порядке.